# Используем официальный образ Python в качестве базового образа
FROM python:3.10
# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app
# Копируем файлы зависимостей проекта в контейнер
COPY requirements.txt .
# Устанавливаем зависимости проекта
RUN pip install --no-cache-dir -r requirements.txt
# Копируем все файлы проекта в контейнер
COPY . .
# Указываем порт, который будет доступен в контейнере
EXPOSE 8000
# Команда, которая будет запущена при старте контейнера
CMD ["python", "-m", "uvicorn", "main:app", "--host", "0.0.0.0", "--port", "8000"]